BRB_Documentation/docs/SOAP/20130902_ApprovedRequestForBREDITU_PERIWINKLE2.txt


---------------  EXAM REQUEST 

<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
               <soapenv:Body>
<p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
<RequestBody>&lt;WebICIdentityExamRequest&gt;
&lt;firstName&gt;BREDITU&lt;/firstName&gt;
&lt;middleName&gt;&lt;/middleName&gt;
&lt;lastName&gt;PERIWINKLE2&lt;/lastName&gt;
&lt;channel&gt;WEBIC&lt;/channel&gt;
&lt;driversLicense&gt;&lt;/driversLicense&gt;
&lt;driversLicenseExpirationDate&gt;&lt;/driversLicenseExpirationDate&gt;
&lt;phoneNumber&gt;&lt;/phoneNumber&gt;
&lt;dateOfBirth&gt;01/17/1970&lt;/dateOfBirth&gt;
&lt;address&gt;
&lt;addressLine1&gt;LEACOCK COURT&lt;/addressLine1&gt;
&lt;addressLine2&gt;&lt;/addressLine2&gt;
&lt;addressLine3&gt;&lt;/addressLine3&gt;
&lt;city&gt;DARTMOUTH&lt;/city&gt;
&lt;province&gt;NS&lt;/province&gt;
&lt;postalCode&gt;B2W4J4&lt;/postalCode&gt;
&lt;/address&gt;
&lt;/WebICIdentityExamRequest&gt;
</RequestBody>
</p282:RequestBody>
</soapenv:Body>
</soapenv:Envelope>


----------------- EXAM RESPONSE

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <WebICIdentityExamResponse>  <identityExam>    <id>1228019</id>    <transactionId>1378140043953</transactionId>    <score>0.00000</score>    <state>issued</state>    <questions>      <question>        <id>150</id>        <text>IN THE PAST 5 YEARS, WHICH PROVINCE HAVE YOU LIVED IN?</text>        <state>un-scored</state>        <maxTimeToAnswer>45</maxTimeToAnswer>        <possibleAnswers>          <answer>            <id>0</id>            <text>QUEBEC</text>          </answer>          <answer>            <id>1</id>            <text>ONTARIO</text>          </answer>          <answer>            <id>2</id>            <text>NONE OF THE ABOVE</text>          </answer>        </possibleAnswers>      </question>      <question>        <id>151</id>        <text>IN 2013, YOU LIVED IN WHICH OF THE FOLLOWING CITIES?</text>        <state>un-scored</state>        <maxTimeToAnswer>120</maxTimeToAnswer>        <possibleAnswers>          <answer>            <id>0</id>            <text>WELLAND</text>          </answer>          <answer>            <id>1</id>            <text>SUNDERLAND</text>          </answer>          <answer>            <id>2</id>            <text>NONE OF THE ABOVE</text>          </answer>        </possibleAnswers>      </question>      <question>        <id>148</id>        <text>FROM THE FOLLOWING LIST, SELECT ONE OF YOUR PREVIOUS ADDRESSES.</text>        <state>un-scored</state>        <maxTimeToAnswer>45</maxTimeToAnswer>        <possibleAnswers>          <answer>            <id>0</id>            <text>555 PRINCE CHARLES</text>          </answer>          <answer>            <id>1</id>            <text>801 CLINTON </text>          </answer>          <answer>            <id>2</id>            <text>NONE OF THE ABOVE</text>          </answer>        </possibleAnswers>      </question>    </questions>  </identityExam></WebICIdentityExamResponse>]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>



---------------SCORING REQUEST 
//	We should add @@@ &lt;channel&gt;WEBIC&lt;/channel&gt; @@@ above "transactionId" Tag
//	We should add @@@ &lt;answerId&gt;1&lt;/answerId&gt; @@@ under every "maxTimeToAnswer" Tag with the right answers to the questions
//	known Right answers (use "NONE OF THE ABOVE" answer if there is no such answer in the list:
//	Qestion ID: 177, Right answer: "2"
//	Qestion ID: 151, Right answer: "WELLAND"
//	Qestion ID: 150, Right answer: "ONTARIO"
//	Qestion ID: 148, Right answer: "555 PRINCE CHARLES"
	

<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
	<p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
	    <RequestBody>&lt;WebICScoreIdentityExamRequest&gt;
&lt;identityExam&gt;
		&lt;id&gt;1228019&lt;/id&gt;
		&lt;channel&gt;WEBIC&lt;/channel&gt;
		&lt;transactionId&gt;1378140043953&lt;/transactionId&gt;
		&lt;score&gt;0.00000&lt;/score&gt;
		&lt;state&gt;issued&lt;/state&gt;
		&lt;questions&gt;
			&lt;question&gt;
				&lt;id&gt;150&lt;/id&gt;
				&lt;text&gt;IN THE PAST 5 YEARS, WHICH PROVINCE HAVE YOU LIVED IN?&lt;/text&gt;
				&lt;state&gt;un-scored&lt;/state&gt;
				&lt;maxTimeToAnswer&gt;45&lt;/maxTimeToAnswer&gt;
				&lt;answerId&gt;1&lt;/answerId&gt;
				&lt;possibleAnswers&gt;
					&lt;answer&gt;
						&lt;id&gt;0&lt;/id&gt;
						&lt;text&gt;QUEBEC&lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;1&lt;/id&gt;
						&lt;text&gt;ONTARIO&lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;2&lt;/id&gt;
						&lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;
					&lt;/answer&gt;
				&lt;/possibleAnswers&gt;
			&lt;/question&gt;
			&lt;question&gt;
				&lt;id&gt;151&lt;/id&gt;
				&lt;text&gt;IN 2013, YOU LIVED IN WHICH OF THE FOLLOWING CITIES?&lt;/text&gt;
				&lt;state&gt;un-scored&lt;/state&gt;
				&lt;maxTimeToAnswer&gt;120&lt;/maxTimeToAnswer&gt;
				&lt;answerId&gt;0&lt;/answerId&gt;
				&lt;possibleAnswers&gt;
					&lt;answer&gt;
						&lt;id&gt;0&lt;/id&gt;
						&lt;text&gt;WELLAND&lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;1&lt;/id&gt;
						&lt;text&gt;SUNDERLAND&lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;2&lt;/id&gt;
						&lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;
					&lt;/answer&gt;
				&lt;/possibleAnswers&gt;
			&lt;/question&gt;
			&lt;question&gt;
				&lt;id&gt;148&lt;/id&gt;
				&lt;text&gt;FROM THE FOLLOWING LIST, SELECT ONE OF YOUR PREVIOUS
					ADDRESSES.&lt;/text&gt;
				&lt;state&gt;un-scored&lt;/state&gt;
				&lt;maxTimeToAnswer&gt;45&lt;/maxTimeToAnswer&gt;
				&lt;answerId&gt;0&lt;/answerId&gt;
				&lt;possibleAnswers&gt;
					&lt;answer&gt;
						&lt;id&gt;0&lt;/id&gt;
						&lt;text&gt;555 PRINCE CHARLES&lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;1&lt;/id&gt;
						&lt;text&gt;801 CLINTON &lt;/text&gt;
					&lt;/answer&gt;
					&lt;answer&gt;
						&lt;id&gt;2&lt;/id&gt;
						&lt;text&gt;NONE OF THE ABOVE&lt;/text&gt;
					&lt;/answer&gt;
				&lt;/possibleAnswers&gt;
			&lt;/question&gt;
		&lt;/questions&gt;
	&lt;/identityExam&gt;
&lt;/WebICScoreIdentityExamRequest&gt;
	    </RequestBody>
	</p282:RequestBody>
    </soapenv:Body>
</soapenv:Envelope>




----------- SCORING RESPONSE 

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>TU_AUTHENTICATION_EXAM_IDENTITY</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <WebICScoreIdentityExamResponse>  <identityExam>    <externalId>1378140043953</externalId>    <sessionId>1228019</sessionId>    <score>100.00000</score>    <decision>PASSED</decision>    <earnPoints>60</earnPoints>    <possiblePoints>60</possiblePoints>  </identityExam></WebICScoreIdentityExamResponse>]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>




----------- ACCOUNT REQUEST


<soapenv:Envelope
    xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:soapenv = "http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd = "http://www.w3.org/2001/XMLSchema"
    xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <p282:MessageHeader xmlns:p282 = "http://www.ctc.ctfs.channel.com/WebICGateway/">
            <messageHeader>
                <secureContentFlag>1</secureContentFlag>
                <messageType>ACCOUNT_APPLICATION</messageType>
                <responseMode>Synchronous</responseMode>
                <messageId>1</messageId>
                <correlationId>1234</correlationId>
            </messageHeader>
        </p282:MessageHeader>
    </soapenv:Header>
    <soapenv:Body>
                <p282:RequestBody xmlns:p282="http://www.ctc.ctfs.channel.com/WebICGateway/">
                    <RequestBody>
<![CDATA[
<AccountApplicationRequest>
  <externalReferenceId>A3981AE7-5848-4F91-BA07-4FD7A6184A9F</externalReferenceId>
  <storeNumber>500</storeNumber>
  <agentId>MQSYS</agentId>
  <channelIndicator>WP</channelIndicator>
  <agencyPromoCode></agencyPromoCode>
  <acquistionStrategyCode>005577</acquistionStrategyCode>
  <requestedProductType>OMP</requestedProductType>
  <firstName>BREDITU</firstName>
  <lastName>PERIWINKLE</lastName>
  <middleInitial></middleInitial>
  <dateOfBirth>1970-01-17</dateOfBirth>
  <idType>DR</idType>
  <idNumber>BRB</idNumber>
  <tuExamResult>Y</tuExamResult>
  <tuSessionId>1228019</tuSessionId>
  <emailConsentFlag>N</emailConsentFlag>
  <placeOfIssue>AB</placeOfIssue>
  <preferedLanguage>E</preferedLanguage>
  <applicantGender>M</applicantGender>
  <currentAddressType>O</currentAddressType>
  <currentAddressLine1>LEACOCK COURT</currentAddressLine1>
  <currentAddressLine2></currentAddressLine2>
  <currentCity>DARTMOUTH</currentCity>
  <currentProvince>NS</currentProvince>
  <currentPostalCode>B2W4J4</currentPostalCode>
  <currentCountry>CA</currentCountry>
  <currentTelephoneNumber>1111111111</currentTelephoneNumber>
  <yearsAtCurrentAddress>16</yearsAtCurrentAddress>
  <monthsAtCurrentAddress>7</monthsAtCurrentAddress>
  <currentEmailAddress>qa@ws.ws</currentEmailAddress>
  <previousAddressLine1> </previousAddressLine1>
  <previousAddressLine2></previousAddressLine2>
  <previousCity></previousCity>
  <previousPostalCode></previousPostalCode>
  <previousCountry>CA</previousCountry>
  <employementStatus>F</employementStatus>
  <jobTitle>MA</jobTitle>
  <employementCategory>MA</employementCategory>
  <employerName>YEPTEL</employerName>
  <employerCity>DARTMOUTH</employerCity>
  <employerCountry>CA</employerCountry>
  <yearsAtEmployement>16</yearsAtEmployement>
  <monthsAtEmployement>1</monthsAtEmployement>
  <grossAnnualIncome>12299</grossAnnualIncome>
  <monthlyRentMortgageAmount>0</monthlyRentMortgageAmount>
  <bankCardFlag>N</bankCardFlag>
  <bankLoanFlag>N</bankLoanFlag>
  <chequingAccountFlag>N</chequingAccountFlag>
  <savingsAccountFlag>N</savingsAccountFlag>
  <storeCardFlag>N</storeCardFlag>
  <gasCardFlag>N</gasCardFlag>
  <supp1Country>CA</supp1Country>
  <agreedToTermsFlag>Y</agreedToTermsFlag>
  <signatureFlag>Y</signatureFlag>
  <signatureMatchFlag>Y</signatureMatchFlag>
  <insuranceAgreedFlag>N</insuranceAgreedFlag>
  <insuranceCode>N</insuranceCode>
  <roadsideOnRequestFlag>N</roadsideOnRequestFlag>
</AccountApplicationRequest>
]]>
                    
                    </RequestBody>
                </p282:RequestBody>
    </soapenv:Body>
</soapenv:Envelope>







--------------- ACCOUNT RESPONSE




<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <p309:MessageHeader xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <messageHeader>
            <secureContentFlag>1</secureContentFlag>
            <messageType>ACCOUNT_APPLICATION</messageType>
            <responseMode>Synchronous</responseMode>
            <messageId>1</messageId>
            <correlationId>1234</correlationId>
         </messageHeader>
      </p309:MessageHeader>
   </soapenv:Header>
   <soapenv:Body>
      <p309:ResponseBody xmlns:p309="http://www.ctc.ctfs.channel.com/WebICGateway/">
         <ResponseBody>
            <requestStatus>Success</requestStatus>
            <resultDocument><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <tns:AccountApplicationResponse>  <tns:accountNumber>maktFoAp51qsRswEprlHq8SYeQ2pQ4Rzgc8m68RBuGYn1jB+XcMLnJ2ABlHvTKMFoKTgMONIpUdy0R4W4ongNWXSde0iP3lcxgWXpSEp6yZ+5chVHTt0YGdfqelcnZ5hwEuWp+xxMGNZJO7plTNFwE12jzVtFAIGWF2V3R1viqEoclsm94NTpurZbOYhi63yCc32OvIQYAz8i4ofy8J0ASYxRWsN2BczYG9yxb7qWuQylKgyMtKyEowEOJHqOzoBJxkwKt+YKbV8vXS1ns/vwNXP68foeJvUY/DnkTiD3TIAR5a2rgtAXhGEnCwqQm474quLCIiYF/HZMszpeYH2UBT01030sIWxGbY2jYsZDLwiNf0Ud/LMwDB9cEuLEsA12cvJ7FYrkv9rGVuScyhpdUKX79+CO0kUyKechgS+u1cRl8P4iMba/d5MzMo7PWvX3Puzcfgjm9RSWpgC2a5teahzA2Tbuur0KOs61mAAo/7E6xPzmKAF8VSzd5VN4MzGwkCSzIZ1erfwKCqWmYdcNk1fZ5L9OoVFtPT+0DiuG2W8moBvdvtZWxC0vHoZKb/J13WRvv0pQBi8S3w3flCq0t/3nMFnKoKDiMRQ7PxN48Z9BT5dHUe/n+zUgLNBrBpmexh77Dmd1yLL2W6IeaDUsDwyHoDyaySMEfrU7rhh8i8=</tns:accountNumber>  <tns:expiryDate>1709</tns:expiryDate>  <tns:creditLimit>3000</tns:creditLimit>  <tns:apr>19.99</tns:apr>  <tns:cashApr>21.99</tns:cashApr>  <tns:appStatus>APPROVED</tns:appStatus>  <tns:customerValueInd>0</tns:customerValueInd></tns:AccountApplicationResponse>]]></resultDocument>
         </ResponseBody>
      </p309:ResponseBody>
   </soapenv:Body>
</soapenv:Envelope>